Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="HOME1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="HOME1R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="52" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HOME1R" edc:desc="" edc:mask="0xf" edc:name="HOME1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="QEA2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEA2R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="53" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEA2R" edc:desc="" edc:mask="0xf" edc:name="QEA2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="QEB2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEB2R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="54" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEB2R" edc:desc="" edc:mask="0xf" edc:name="QEB2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="INDX2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="INDX2R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="55" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDX2R" edc:desc="" edc:mask="0xf" edc:name="INDX2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="HOME2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="HOME2R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="56" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014EC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HOME2R" edc:desc="" edc:mask="0xf" edc:name="HOME2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="FLT1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="FLT1R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="57" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FLT1R" edc:desc="" edc:mask="0xf" edc:name="FLT1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="FLT2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="FLT2R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="58" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FLT2R" edc:desc="" edc:mask="0xf" edc:name="FLT2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="IC10R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC10R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="59" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC10R" edc:desc="" edc:mask="0xf" edc:name="IC10R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="IC11R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC11R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="60" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F8014FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC11R" edc:desc="" edc:mask="0xf" edc:name="IC11R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="IC12R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC12R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="61" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801500">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC12R" edc:desc="" edc:mask="0xf" edc:name="IC12R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="IC13R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC13R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="62" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801504">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC13R" edc:desc="" edc:mask="0xf" edc:name="IC13R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="IC14R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC14R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="63" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801508">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC14R" edc:desc="" edc:mask="0xf" edc:name="IC14R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="IC15R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC15R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="64" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80150C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC15R" edc:desc="" edc:mask="0xf" edc:name="IC15R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="IC16R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="IC16R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="65" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801510">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC16R" edc:desc="" edc:mask="0xf" edc:name="IC16R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SCK5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SCK5R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="66" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801514">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCK5R" edc:desc="" edc:mask="0xf" edc:name="SCK5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SDI5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI5R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="67" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801518">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI5R" edc:desc="" edc:mask="0xf" edc:name="SDI5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
