Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SS5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS5R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="68" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80151C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS5R" edc:desc="" edc:mask="0xf" edc:name="SS5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SCK6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SCK6R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="69" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801520">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCK6R" edc:desc="" edc:mask="0xf" edc:name="SCK6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SDI6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI6R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="70" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801524">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI6R" edc:desc="" edc:mask="0xf" edc:name="SDI6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SS6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS6R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="71" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801528">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS6R" edc:desc="" edc:mask="0xf" edc:name="SS6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="C3RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="C3RXR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="72" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80152C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C3RXR" edc:desc="" edc:mask="0xf" edc:name="C3RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="C4RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="C4RXR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="73" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801530">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C4RXR" edc:desc="" edc:mask="0xf" edc:name="C4RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="QEA3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEA3R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="74" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801534">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEA3R" edc:desc="" edc:mask="0xf" edc:name="QEA3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="QEB3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEB3R" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="75" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801538">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEB3R" edc:desc="" edc:mask="0xf" edc:name="QEB3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
