Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="nn-nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC2" edc:desc="" edc:impl="0xdfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000000000000000000000000000" edc:name="IEC2" edc:nzwidth="32" edc:por="0x-00000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8100E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIE" edc:desc="" edc:mask="0x1" edc:name="U3TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4EIE" edc:desc="" edc:mask="0x1" edc:name="U4EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4RXIE" edc:desc="" edc:mask="0x1" edc:name="U4RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4TXIE" edc:desc="" edc:mask="0x1" edc:name="U4TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5EIE" edc:desc="" edc:mask="0x1" edc:name="U5EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5RXIE" edc:desc="" edc:mask="0x1" edc:name="U5RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5TXIE" edc:desc="" edc:mask="0x1" edc:name="U5TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTMUIE" edc:desc="" edc:mask="0x1" edc:name="CTMUIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA0IE" edc:desc="" edc:mask="0x1" edc:name="DMA0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IE" edc:desc="" edc:mask="0x1" edc:name="DMA1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IE" edc:desc="" edc:mask="0x1" edc:name="DMA2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IE" edc:desc="" edc:mask="0x1" edc:name="DMA3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IE" edc:desc="" edc:mask="0x1" edc:name="T6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6EIE" edc:desc="" edc:mask="0x1" edc:name="IC6EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6IE" edc:desc="" edc:mask="0x1" edc:name="IC6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC6IE" edc:desc="" edc:mask="0x1" edc:name="OC6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T7IE" edc:desc="" edc:mask="0x1" edc:name="T7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7EIE" edc:desc="" edc:mask="0x1" edc:name="IC7EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7IE" edc:desc="" edc:mask="0x1" edc:name="IC7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC7IE" edc:desc="" edc:mask="0x1" edc:name="OC7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8IE" edc:desc="" edc:mask="0x1" edc:name="T8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8EIE" edc:desc="" edc:mask="0x1" edc:name="IC8EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8IE" edc:desc="" edc:mask="0x1" edc:name="IC8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC8IE" edc:desc="" edc:mask="0x1" edc:name="OC8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9IE" edc:desc="" edc:mask="0x1" edc:name="T9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9EIE" edc:desc="" edc:mask="0x1" edc:name="IC9EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9IE" edc:desc="" edc:mask="0x1" edc:name="IC9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC9IE" edc:desc="" edc:mask="0x1" edc:name="OC9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1IE" edc:desc="" edc:mask="0x1" edc:name="AD1IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IE" edc:mask="0x1" edc:name="AD1DC1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IE" edc:desc="" edc:mask="0x1" edc:name="AD1DC2IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IEC3" edc:nzwidth="32" edc:por="0000000000000000000x0000x0000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8100F0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1DF1IE" edc:desc="" edc:mask="0x1" edc:name="AD1DF1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IE" edc:desc="" edc:mask="0x1" edc:name="AD1DF2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF3IE" edc:desc="" edc:mask="0x1" edc:name="AD1DF3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF4IE" edc:desc="" edc:mask="0x1" edc:name="AD1DF4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1FIIE" edc:desc="" edc:mask="0x1" edc:name="AD1FIIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIE" edc:desc="" edc:mask="0x1" edc:name="AD1EOSIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1ARIE" edc:desc="" edc:mask="0x1" edc:name="AD1ARIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1RSIE" edc:mask="0x1" edc:name="AD1RSIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1FCBTIE" edc:desc="" edc:mask="0x1" edc:name="AD1FCBTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1GIE" edc:desc="" edc:mask="0x1" edc:name="AD1GIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D0IE" edc:desc="" edc:mask="0x1" edc:name="AD1D0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D1IE" edc:desc="" edc:mask="0x1" edc:name="AD1D1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D2IE" edc:desc="" edc:mask="0x1" edc:name="AD1D2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D3IE" edc:desc="" edc:mask="0x1" edc:name="AD1D3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D4IE" edc:desc="" edc:mask="0x1" edc:name="AD1D4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D5IE" edc:desc="" edc:mask="0x1" edc:name="AD1D5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D6IE" edc:desc="" edc:mask="0x1" edc:name="AD1D6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D7IE" edc:desc="" edc:mask="0x1" edc:name="AD1D7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D8IE" edc:desc="" edc:mask="0x1" edc:name="AD1D8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D9IE" edc:desc="" edc:mask="0x1" edc:name="AD1D9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D10IE" edc:desc="" edc:mask="0x1" edc:name="AD1D10IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D11IE" edc:desc="" edc:mask="0x1" edc:name="AD1D11IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D12IE" edc:desc="" edc:mask="0x1" edc:name="AD1D12IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D13IE" edc:desc="" edc:mask="0x1" edc:name="AD1D13IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D14IE" edc:desc="" edc:mask="0x1" edc:name="AD1D14IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D15IE" edc:desc="" edc:mask="0x1" edc:name="AD1D15IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D16IE" edc:desc="" edc:mask="0x1" edc:name="AD1D16IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D17IE" edc:desc="" edc:mask="0x1" edc:name="AD1D17IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D18IE" edc:desc="" edc:mask="0x1" edc:name="AD1D18IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D19IE" edc:desc="" edc:mask="0x1" edc:name="AD1D19IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D20IE" edc:desc="" edc:mask="0x1" edc:name="AD1D20IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D21IE" edc:desc="" edc:mask="0x1" edc:name="AD1D21IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnn---nnnnnnnnn-----nnnnnn" edc:cname="IEC4" edc:desc="" edc:impl="0xff8ff83f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000---000000000-----000000" edc:name="IEC4" edc:nzwidth="32" edc:por="000000000---000000000-----000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810100">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D22IE" edc:desc="" edc:mask="0x1" edc:name="AD1D22IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D23IE" edc:desc="" edc:mask="0x1" edc:name="AD1D23IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D24IE" edc:desc="" edc:mask="0x1" edc:name="AD1D24IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D25IE" edc:desc="" edc:mask="0x1" edc:name="AD1D25IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D26IE" edc:desc="" edc:mask="0x1" edc:name="AD1D21IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D27IE" edc:desc="" edc:mask="0x1" edc:name="AD1D27IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="AD1D33IE" edc:desc="" edc:mask="0x1" edc:name="AD1D33IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D34IE" edc:desc="" edc:mask="0x1" edc:name="AD1D34IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D35IE" edc:desc="" edc:mask="0x1" edc:name="AD1D35IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D36IE" edc:desc="" edc:mask="0x1" edc:name="AD1D36IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D37IE" edc:desc="" edc:mask="0x1" edc:name="AD1D37IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D38IE" edc:desc="" edc:mask="0x1" edc:name="AD1D38IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D39IE" edc:desc="" edc:mask="0x1" edc:name="AD1D39IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D40IE" edc:desc="" edc:mask="0x1" edc:name="AD1D40IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D41IE" edc:desc="" edc:mask="0x1" edc:name="AD1D41IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D45IE" edc:desc="" edc:mask="0x1" edc:name="AD1D45IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D46IE" edc:desc="" edc:mask="0x1" edc:name="AD1D46IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D47IE" edc:desc="" edc:mask="0x1" edc:name="AD1D47IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D48IE" edc:desc="" edc:mask="0x1" edc:name="AD1D48IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D49IE" edc:desc="" edc:mask="0x1" edc:name="AD1D49IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D50IE" edc:desc="" edc:mask="0x1" edc:name="AD1D50IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D51IE" edc:desc="" edc:mask="0x1" edc:name="AD1D51IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D52IE" edc:desc="" edc:mask="0x1" edc:name="AD1D52IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D53IE" edc:desc="" edc:mask="0x1" edc:name="AD1D53IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
