Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC27" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC27" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8102F0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D2IS" edc:desc="" edc:mask="0x3" edc:name="AD1D2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D2IP" edc:desc="" edc:mask="0x7" edc:name="AD1D2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D3IS" edc:desc="" edc:mask="0x3" edc:name="AD1D3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D3IP" edc:desc="" edc:mask="0x7" edc:name="AD1D3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D4IS" edc:desc="" edc:mask="0x3" edc:name="AD1D4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D4IP" edc:desc="" edc:mask="0x7" edc:name="AD1D4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D5IS" edc:desc="" edc:mask="0x3" edc:name="AD1D5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D5IP" edc:desc="" edc:mask="0x7" edc:name="AD1D5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC28" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC28" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810300">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D6IS" edc:desc="" edc:mask="0x3" edc:name="AD1D6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D6IP" edc:desc="" edc:mask="0x7" edc:name="AD1D6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D7IS" edc:desc="" edc:mask="0x3" edc:name="AD1D7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D7IP" edc:desc="" edc:mask="0x7" edc:name="AD1D7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D8IS" edc:desc="" edc:mask="0x3" edc:name="AD1D8IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D8IP" edc:desc="" edc:mask="0x7" edc:name="AD1D8IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D9IS" edc:desc="" edc:mask="0x3" edc:name="AD1D9IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D9IP" edc:desc="" edc:mask="0x7" edc:name="AD1D9IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC29" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC29" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810310">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D10IS" edc:desc="" edc:mask="0x3" edc:name="AD1D10IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D10IP" edc:desc="" edc:mask="0x7" edc:name="AD1D10IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D11IS" edc:desc="" edc:mask="0x3" edc:name="AD1D11IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D11IP" edc:desc="" edc:mask="0x7" edc:name="AD1D11IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D12IS" edc:desc="" edc:mask="0x3" edc:name="AD1D12IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D12IP" edc:desc="" edc:mask="0x7" edc:name="AD1D12IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D13IS" edc:desc="" edc:mask="0x3" edc:name="AD1D13IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D13IP" edc:desc="" edc:mask="0x7" edc:name="AD1D13IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC30" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC30" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810320">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D14IS" edc:desc="" edc:mask="0x3" edc:name="AD1D14IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D14IP" edc:desc="" edc:mask="0x7" edc:name="AD1D14IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D15IS" edc:desc="" edc:mask="0x3" edc:name="AD1D15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D15IP" edc:desc="" edc:mask="0x7" edc:name="AD1D15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D16IS" edc:desc="" edc:mask="0x3" edc:name="AD1D16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D16IP" edc:desc="" edc:mask="0x7" edc:name="AD1D16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D17IS" edc:desc="" edc:mask="0x3" edc:name="AD1D17IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D17IP" edc:desc="" edc:mask="0x7" edc:name="AD1D17IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC31" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC31" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810330">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D18IS" edc:desc="" edc:mask="0x3" edc:name="AD1D18IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D18IP" edc:desc="" edc:mask="0x7" edc:name="AD1D18IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D19IS" edc:desc="" edc:mask="0x3" edc:name="AD1D19IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D19IP" edc:desc="" edc:mask="0x7" edc:name="AD1D19IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D20IS" edc:desc="" edc:mask="0x3" edc:name="AD1D20IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D20IP" edc:desc="" edc:mask="0x7" edc:name="AD1D20IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D21IS" edc:desc="" edc:mask="0x3" edc:name="AD1D21IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1D21IP" edc:desc="" edc:mask="0x7" edc:name="AD1D21IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
