Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC41" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC41" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8103D0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U6EIS" edc:desc="" edc:mask="0x3" edc:name="U6EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U6EIP" edc:desc="" edc:mask="0x7" edc:name="U6EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U6RXIS" edc:desc="" edc:mask="0x3" edc:name="U6RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U6RXIP" edc:desc="" edc:mask="0x7" edc:name="U6RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U6TXIS" edc:desc="" edc:mask="0x3" edc:name="U6TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U6TXIP" edc:desc="" edc:mask="0x7" edc:name="U6TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CAN1IS" edc:desc="" edc:mask="0x3" edc:name="CAN1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN1IP" edc:desc="" edc:mask="0x7" edc:name="CAN1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC42" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---uuuuu---00000" edc:name="IPC42" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---xxxxx---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8103E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAN2IS" edc:desc="" edc:mask="0x3" edc:name="CAN2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN2IP" edc:desc="" edc:mask="0x7" edc:name="CAN2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="QEI1IS" edc:mask="0x3" edc:name="QEI1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QEI1IP" edc:mask="0x7" edc:name="QEI1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="QEI2IS" edc:mask="0x3" edc:name="QEI2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QEI2IP" edc:mask="0x7" edc:name="QEI2IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWMPEVTSIP" edc:mask="0x3" edc:name="PWMPEVTSIP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWMPEVTIP" edc:mask="0x7" edc:name="PWMPEVTIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC43" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---uuuuu---uuuuu" edc:name="IPC43" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---xxxxx---xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8103F0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWMSIS" edc:mask="0x3" edc:name="PWMSIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWMSIP" edc:mask="0x7" edc:name="PWMSIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM1IS" edc:mask="0x3" edc:name="PWM1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM1IP" edc:mask="0x7" edc:name="PWM1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM2IS" edc:mask="0x3" edc:name="PWM2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM2IP" edc:mask="0x7" edc:name="PWM2IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM3IS" edc:mask="0x3" edc:name="PWM3IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM3IP" edc:mask="0x7" edc:name="PWM3IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC44" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---uuuuu---uuuuu---uuuuu" edc:name="IPC44" edc:nzwidth="32" edc:por="---00000---xxxxx---xxxxx---xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810400">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWM4IS" edc:mask="0x3" edc:name="PWM4IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM4IP" edc:mask="0x7" edc:name="PWM4IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM5IS" edc:mask="0x3" edc:name="PWM5IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM5IP" edc:mask="0x7" edc:name="PWM5IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM6IS" edc:mask="0x3" edc:name="PWM6IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM6IP" edc:mask="0x7" edc:name="PWM6IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="I2C3BIS" edc:desc="" edc:mask="0x3" edc:name="I2C3BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3BIP" edc:desc="" edc:mask="0x7" edc:name="I2C3BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC45" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC45" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810410">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C3SIS" edc:desc="" edc:mask="0x3" edc:name="I2C3SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3SIP" edc:desc="" edc:mask="0x7" edc:name="I2C3SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C3MIS" edc:desc="" edc:mask="0x3" edc:name="I2C3MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3MIP" edc:desc="" edc:mask="0x7" edc:name="I2C3MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA4IS" edc:desc="" edc:mask="0x3" edc:name="DMA4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA4IP" edc:desc="" edc:mask="0x7" edc:name="DMA4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA5IS" edc:desc="" edc:mask="0x3" edc:name="DMA5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA5IP" edc:desc="" edc:mask="0x7" edc:name="DMA5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC46" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC46" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810420">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA6IS" edc:desc="" edc:mask="0x3" edc:name="DMA6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA6IP" edc:desc="" edc:mask="0x7" edc:name="DMA6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA7IS" edc:desc="" edc:mask="0x3" edc:name="DMA7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA7IP" edc:desc="" edc:mask="0x7" edc:name="DMA7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DATAEEIS" edc:desc="" edc:mask="0x3" edc:name="DATAEEIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DATAEEIP" edc:desc="" edc:mask="0x7" edc:name="DATAEEIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CAN3IS" edc:desc="" edc:mask="0x3" edc:name="CAN3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN3IP" edc:desc="" edc:mask="0x7" edc:name="CAN3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC47" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---uuuuu---00000" edc:name="IPC47" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---xxxxx---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810430">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAN4IS" edc:desc="" edc:mask="0x3" edc:name="CAN4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN4IP" edc:desc="" edc:mask="0x7" edc:name="CAN4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="QEI3IS" edc:mask="0x3" edc:name="QEI3IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QEI3IP" edc:mask="0x7" edc:name="QEI3IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="QEI4IS" edc:mask="0x3" edc:name="QEI4IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QEI4IP" edc:mask="0x7" edc:name="QEI4IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="QEI5IS" edc:mask="0x3" edc:name="QEI5IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QEI5IP" edc:mask="0x7" edc:name="QEI5IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn-----------nnnnn" edc:cname="IPC48" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000-----------uuuuu" edc:name="IPC48" edc:nzwidth="32" edc:por="---00000---00000-----------xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810440">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEI6IS" edc:mask="0x3" edc:name="QEI6IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="QEI6IP" edc:mask="0x7" edc:name="QEI6IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="I2C4BIS" edc:desc="" edc:mask="0x3" edc:name="I2C4BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4BIP" edc:desc="" edc:mask="0x7" edc:name="I2C4BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C4SIS" edc:desc="" edc:mask="0x3" edc:name="I2C4SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4SIP" edc:desc="" edc:mask="0x7" edc:name="I2C4SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
