Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC53" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC53" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810490">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC15EIS" edc:desc="" edc:mask="0x3" edc:name="IC15EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC15EIP" edc:desc="" edc:mask="0x7" edc:name="IC15EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC15IS" edc:desc="" edc:mask="0x3" edc:name="IC15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC15IP" edc:desc="" edc:mask="0x7" edc:name="IC15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC15IS" edc:desc="" edc:mask="0x3" edc:name="OC15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC15IP" edc:desc="" edc:mask="0x7" edc:name="OC15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC16EIS" edc:desc="" edc:mask="0x3" edc:name="IC16EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC16EIP" edc:desc="" edc:mask="0x7" edc:name="IC16EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC54" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC54" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8104A0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC16IS" edc:desc="" edc:mask="0x3" edc:name="IC16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC16IP" edc:desc="" edc:mask="0x7" edc:name="IC16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC16IS" edc:desc="" edc:mask="0x3" edc:name="OC16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC16IP" edc:desc="" edc:mask="0x7" edc:name="OC16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI3EIS" edc:desc="" edc:mask="0x3" edc:name="SPI3EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3EIP" edc:desc="" edc:mask="0x7" edc:name="SPI3EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI3RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI3RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC55" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC55" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8104B0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI3TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI3TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI3TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI4EIS" edc:desc="" edc:mask="0x3" edc:name="SPI4EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI4EIP" edc:desc="" edc:mask="0x7" edc:name="SPI4EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI4RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI4RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI4TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI4TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC56" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC56" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8104C0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI5EIS" edc:desc="" edc:mask="0x3" edc:name="SPI5EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5EIP" edc:desc="" edc:mask="0x7" edc:name="SPI5EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI5RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI5RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI5TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI5TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI6EIS" edc:desc="" edc:mask="0x3" edc:name="SPI6EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI6EIP" edc:desc="" edc:mask="0x7" edc:name="SPI6EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
