Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF008" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF008" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810560">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF009" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF009" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810564">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF010" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF010" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810568">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF011" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF011" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F81056C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF012" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF012" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810570">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF013" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF013" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810574">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF014" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF014" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810578">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF015" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF015" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F81057C">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF016" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF016" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810580">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF017" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF017" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810584">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
