Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="POS5HLD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="POS5HLD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BA40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POSHLD" edc:mask="0xffffffff" edc:name="POSHLD" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="VEL5CNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="VEL5CNT" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BA50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VELCNT" edc:mask="0xffffffff" edc:name="VELCNT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="VEL5HLD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="VEL5HLD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BA60">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VELHLD" edc:mask="0xffffffff" edc:name="VELHLD" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INT5TMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INT5TMR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BA70">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTTMR" edc:mask="0xffffffff" edc:name="INTTMR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INT5HLD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INT5HLD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BA80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTHLD" edc:mask="0xffffffff" edc:name="INTHLD" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INDX5CNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INDX5CNT" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BA90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDXCNT" edc:mask="0xffffffff" edc:name="INDXCNT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INDX5HLD" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="INDX5HLD" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BAA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDXHLD" edc:mask="0xffffffff" edc:name="INDXHLD" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="QEI5ICC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="QEI5ICC" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BAB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEIICC" edc:mask="0xffffffff" edc:name="QEIICC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="QEI5CMPL" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="QEI5CMPL" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BAC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEICMPL" edc:mask="0xffffffff" edc:name="QEICMPL" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x130" edc:_addr="0x1F82BAD0"/>
      <edc:SFRDef edc:access="----------------n-nnnnnn-nnnn-nn" edc:cname="QEI6CON" edc:desc="" edc:impl="0xbf7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-000000-0000-00" edc:name="QEI6CON" edc:nzwidth="32" edc:por="----------------0-000000-0000-00" edc:portals="CLR SET INV" edc:_modsrc="DOS-01494_qei_32b_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xd0" edc:_addr="0x1F82BC00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCM" edc:mask="0x3" edc:name="CCM" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="GATEN" edc:desc="" edc:mask="0x1" edc:name="GATEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNTPOL" edc:desc="" edc:mask="0x1" edc:name="CNTPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INTDIV" edc:desc="" edc:mask="0x7" edc:name="INTDIV" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IMV" edc:desc="" edc:mask="0x3" edc:name="IMV" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PIMOD" edc:desc="" edc:mask="0x7" edc:name="PIMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="QEISIDL" edc:desc="" edc:mask="0x1" edc:name="QEISIDL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="QEIEN" edc:desc="" edc:mask="0x1" edc:name="QEIEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
