Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNNEB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNNEB" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8601A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEB0" edc:mask="0x1" edc:name="CNNEB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB1" edc:mask="0x1" edc:name="CNNEB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB2" edc:mask="0x1" edc:name="CNNEB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB3" edc:mask="0x1" edc:name="CNNEB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB4" edc:mask="0x1" edc:name="CNNEB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB5" edc:mask="0x1" edc:name="CNNEB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB6" edc:mask="0x1" edc:name="CNNEB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB7" edc:mask="0x1" edc:name="CNNEB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB8" edc:mask="0x1" edc:name="CNNEB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB9" edc:mask="0x1" edc:name="CNNEB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB10" edc:mask="0x1" edc:name="CNNEB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB11" edc:mask="0x1" edc:name="CNNEB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB12" edc:mask="0x1" edc:name="CNNEB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB13" edc:mask="0x1" edc:name="CNNEB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB14" edc:mask="0x1" edc:name="CNNEB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB15" edc:mask="0x1" edc:name="CNNEB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNFB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNFB" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8601B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFB0" edc:mask="0x1" edc:name="CNFB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB1" edc:mask="0x1" edc:name="CNFB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB2" edc:mask="0x1" edc:name="CNFB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB3" edc:mask="0x1" edc:name="CNFB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB4" edc:mask="0x1" edc:name="CNFB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB5" edc:mask="0x1" edc:name="CNFB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB6" edc:mask="0x1" edc:name="CNFB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB7" edc:mask="0x1" edc:name="CNFB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB8" edc:mask="0x1" edc:name="CNFB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB9" edc:mask="0x1" edc:name="CNFB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB10" edc:mask="0x1" edc:name="CNFB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB11" edc:mask="0x1" edc:name="CNFB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB12" edc:mask="0x1" edc:name="CNFB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB13" edc:mask="0x1" edc:name="CNFB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB14" edc:mask="0x1" edc:name="CNFB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB15" edc:mask="0x1" edc:name="CNFB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnnnn--nn-n----" edc:cname="SRCON0B" edc:desc="" edc:impl="0xfcd0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000--00-0----" edc:name="SRCON0B" edc:nzwidth="32" edc:por="----------------000000--00-0----" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8601C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0B4" edc:mask="0x1" edc:name="SR0B4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0B6" edc:mask="0x1" edc:name="SR0B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B7" edc:mask="0x1" edc:name="SR0B7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0B10" edc:mask="0x1" edc:name="SR0B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B11" edc:mask="0x1" edc:name="SR0B11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B12" edc:mask="0x1" edc:name="SR0B12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B13" edc:mask="0x1" edc:name="SR0B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B14" edc:mask="0x1" edc:name="SR0B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0B15" edc:mask="0x1" edc:name="SR0B15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
