Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="-----------------------n-nnnnnn-" edc:cname="SRCON1D" edc:desc="" edc:impl="0x17e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------0-000000-" edc:name="SRCON1D" edc:nzwidth="32" edc:por="-----------------------0-000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8603D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1D1" edc:mask="0x1" edc:name="SR1D1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D2" edc:mask="0x1" edc:name="SR1D2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D3" edc:mask="0x1" edc:name="SR1D3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D4" edc:mask="0x1" edc:name="SR1D4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D5" edc:mask="0x1" edc:name="SR1D5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D6" edc:mask="0x1" edc:name="SR1D6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1D8" edc:mask="0x1" edc:name="SR1D8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x1F8603E0"/>
      <edc:SFRDef edc:access="----------------nnnn--nn------nn" edc:cname="ANSELE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111--11------11" edc:name="ANSELE" edc:nzwidth="0x20" edc:por="----------------1111--11------11" edc:portals="CLR SET INV" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSE0" edc:desc="" edc:mask="0x1" edc:name="ANSE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE1" edc:desc="" edc:mask="0x1" edc:name="ANSE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSE8" edc:desc="" edc:mask="0x1" edc:name="ANSE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE9" edc:desc="" edc:mask="0x1" edc:name="ANSE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSE12" edc:desc="" edc:mask="0x1" edc:name="ANSE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE13" edc:desc="" edc:mask="0x1" edc:name="ANSE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE14" edc:desc="" edc:mask="0x1" edc:name="ANSE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE15" edc:desc="" edc:mask="0x1" edc:name="ANSE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnn--nn------nn" edc:cname="TRISE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111--11------11" edc:name="TRISE" edc:nzwidth="0x20" edc:por="----------------1111--11------11" edc:portals="CLR SET INV" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISE0" edc:desc="" edc:mask="0x1" edc:name="TRISE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE1" edc:desc="" edc:mask="0x1" edc:name="TRISE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISE8" edc:desc="" edc:mask="0x1" edc:name="TRISE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISE9" edc:desc="" edc:mask="0x1" edc:name="TRISE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISE12" edc:desc="" edc:mask="0x1" edc:name="TRISE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISE13" edc:desc="" edc:mask="0x1" edc:name="TRISE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISE14" edc:desc="" edc:mask="0x1" edc:name="TRISE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE15" edc:desc="" edc:mask="0x1" edc:name="TRISE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnn--nn------nn" edc:cname="PORTE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx--xx------xx" edc:name="PORTE" edc:nzwidth="0x20" edc:por="----------------xxxx--xx------xx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTE" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RE8" edc:desc="" edc:mask="0x1" edc:name="RE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RE9" edc:desc="" edc:mask="0x1" edc:name="RE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RE12" edc:desc="" edc:mask="0x1" edc:name="RE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RE13" edc:desc="" edc:mask="0x1" edc:name="RE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RE14" edc:desc="" edc:mask="0x1" edc:name="RE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE15" edc:desc="" edc:mask="0x1" edc:name="RE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------nnnn--nn------nn" edc:cname="LATE" edc:desc="" edc:grp="PORTE" edc:impl="0xfffff303" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx--xx------xx" edc:name="LATE" edc:nzwidth="0x20" edc:por="----------------xxxx--xx------xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATE0" edc:desc="" edc:mask="0x1" edc:name="LATE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE1" edc:desc="" edc:mask="0x1" edc:name="LATE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATE8" edc:desc="" edc:mask="0x1" edc:name="LATE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATE9" edc:desc="" edc:mask="0x1" edc:name="LATE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATE12" edc:desc="" edc:mask="0x1" edc:name="LATE12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATE13" edc:desc="" edc:mask="0x1" edc:name="LATE13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATE14" edc:desc="" edc:mask="0x1" edc:name="LATE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE15" edc:desc="" edc:mask="0x1" edc:name="LATE15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
