Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="------------------nn-nn-nnn---nn" edc:cname="CNSTATF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="CNSTATF" edc:nzwidth="0x20" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860590">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATF0" edc:desc="" edc:mask="0x1" edc:name="CNSTATF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF1" edc:desc="" edc:mask="0x1" edc:name="CNSTATF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF5" edc:desc="" edc:mask="0x1" edc:name="CNSTATF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF6" edc:desc="" edc:mask="0x1" edc:name="CNSTATF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF7" edc:desc="" edc:mask="0x1" edc:name="CNSTATF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF9" edc:desc="" edc:mask="0x1" edc:name="CNSTATF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF10" edc:desc="" edc:mask="0x1" edc:name="CNSTATF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF12" edc:desc="" edc:mask="0x1" edc:name="CNSTATF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF13" edc:desc="" edc:mask="0x1" edc:name="CNSTATF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nn-nn-nnn---nn" edc:cname="CNNEF" edc:desc="" edc:impl="0x36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="CNNEF" edc:nzwidth="32" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8605A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEF0" edc:mask="0x1" edc:name="CNNEF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF1" edc:mask="0x1" edc:name="CNNEF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEF5" edc:mask="0x1" edc:name="CNNEF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF6" edc:mask="0x1" edc:name="CNNEF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF7" edc:mask="0x1" edc:name="CNNEF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEF9" edc:mask="0x1" edc:name="CNNEF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF10" edc:mask="0x1" edc:name="CNNEF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEF12" edc:mask="0x1" edc:name="CNNEF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF13" edc:mask="0x1" edc:name="CNNEF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------nn-nn-nnn---nn" edc:cname="CNFF" edc:desc="" edc:impl="0x36e3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-00-000---00" edc:name="CNFF" edc:nzwidth="32" edc:por="------------------00-00-000---00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8605B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFF0" edc:mask="0x1" edc:name="CNFF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF1" edc:mask="0x1" edc:name="CNFF1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFF5" edc:mask="0x1" edc:name="CNFF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF6" edc:mask="0x1" edc:name="CNFF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF7" edc:mask="0x1" edc:name="CNFF7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFF9" edc:mask="0x1" edc:name="CNFF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF10" edc:mask="0x1" edc:name="CNFF10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFF12" edc:mask="0x1" edc:name="CNFF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF13" edc:mask="0x1" edc:name="CNFF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------------------------------nn" edc:cname="SRCON0F" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="SRCON0F" edc:nzwidth="32" edc:por="------------------------------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8605C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0F0" edc:mask="0x1" edc:name="SR0F0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SR0F1" edc:mask="0x1" edc:name="SR0F1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
