Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C3FLTCON3" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C3FLTCON3" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F8840F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL12" edc:desc="" edc:mask="0x1f" edc:name="FSEL12" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL12" edc:desc="" edc:mask="0x3" edc:name="MSEL12" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN12" edc:desc="" edc:mask="0x1" edc:name="FLTEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL13" edc:desc="" edc:mask="0x1f" edc:name="FSEL13" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL13" edc:desc="" edc:mask="0x3" edc:name="MSEL13" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN13" edc:desc="" edc:mask="0x1" edc:name="FLTEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL14" edc:desc="" edc:mask="0x1f" edc:name="FSEL14" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL14" edc:desc="" edc:mask="0x3" edc:name="MSEL14" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN14" edc:desc="" edc:mask="0x1" edc:name="FLTEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL15" edc:desc="" edc:mask="0x1f" edc:name="FSEL15" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL15" edc:desc="" edc:mask="0x3" edc:name="MSEL15" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN15" edc:desc="" edc:mask="0x1" edc:name="FLTEN15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884100"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884110"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884120"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884130"/>
      <edc:SFRDef edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C3RXF0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C3RXF0" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F884140">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C3RXF1" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C3RXF1" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F884150">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C3RXF2" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C3RXF2" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN3" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F884160">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
