Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884750"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884760"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884770"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884780"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884790"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8847A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8847B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8847C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8847D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8847E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8847F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884800"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884810"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884820"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884830"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884840"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884850"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884860"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884870"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884880"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884890"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8848A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8848B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8848C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8848D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8848E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8848F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884900"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884910"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884920"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884930"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884940"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884950"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884960"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884970"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884980"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884990"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8849A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8849B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8849C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8849D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8849E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8849F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884A00"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884A10"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884A20"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884A30"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884A40"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884A50"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884A60"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884A70"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884A80"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884A90"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884AA0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884AB0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884AC0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884AD0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884AE0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884AF0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884B00"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884B10"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884B20"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884B30"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F884B40"/>
      <edc:AdjustPoint edc:offset="0x4b0" edc:_addr="0x1F884B50"/>
      <edc:SFRDef edc:access="----snnnrrrn----n-n-r------nnnnn" edc:cname="C4CON" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----01001000----0-0-0------00000" edc:name="C4CON" edc:nzwidth="0x20" edc:por="----01001000----0-0-0------00000" edc:portals="CLR SET INV" ltx:baseofperipheral="CAN4" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F885000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DNCNT" edc:desc="" edc:mask="0x1f" edc:name="DNCNT" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CANBUSY" edc:desc="" edc:mask="0x1" edc:name="CANBUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CANCAP" edc:desc="" edc:mask="0x1" edc:name="CANCAP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="" edc:mask="0x7" edc:name="OPMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CAN4" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------n---nnnnnnnnnnnnnnnnnnn" edc:cname="C4CFG" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0---0000000000000000000" edc:name="C4CFG" edc:nzwidth="0x20" edc:por="---------0---0000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F885010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BRP" edc:desc="" edc:mask="0x3f" edc:name="BRP" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SJW" edc:desc="" edc:mask="0x3" edc:name="SJW" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PRSEG" edc:desc="" edc:mask="0x7" edc:name="PRSEG" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="SEG1PH" edc:desc="" edc:mask="0x7" edc:name="SEG1PH" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="SAM" edc:desc="" edc:mask="0x1" edc:name="SAM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEG2PHTS" edc:desc="" edc:mask="0x1" edc:name="SEG2PHTS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEG2PH" edc:desc="" edc:mask="0x7" edc:name="SEG2PH" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="WAKFIL" edc:desc="" edc:mask="0x1" edc:name="WAKFIL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
