Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="-----------nnnnn-nnn----nnnnnnnn" edc:cname="C4FIFOCON15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C4FIFOCON15" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F885710">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXPRI" edc:desc="" edc:mask="0x3" edc:name="TXPRI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABAT" edc:desc="" edc:mask="0x1" edc:name="TXABAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DONLY" edc:desc="" edc:mask="0x1" edc:name="DONLY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:desc="" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:desc="" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:desc="" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----nnn----nnnn-----rrr----nrrr" edc:cname="C4FIFOINT15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C4FIFOINT15" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F885720">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXNEMPTYIF" edc:desc="" edc:mask="0x1" edc:name="RXNEMPTYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXHALFIF" edc:desc="" edc:mask="0x1" edc:name="RXHALFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFULLIF" edc:desc="" edc:mask="0x1" edc:name="RXFULLIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVFLIF" edc:desc="" edc:mask="0x1" edc:name="RXOVFLIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="TXEMPTYIF" edc:desc="" edc:mask="0x1" edc:name="TXEMPTYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXHALFIF" edc:desc="" edc:mask="0x1" edc:name="TXHALFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXNFULLIF" edc:desc="" edc:mask="0x1" edc:name="TXNFULLIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RXNEMPTYIE" edc:desc="" edc:mask="0x1" edc:name="RXNEMPTYIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXHALFIE" edc:desc="" edc:mask="0x1" edc:name="RXHALFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFULLIE" edc:desc="" edc:mask="0x1" edc:name="RXFULLIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVFLIE" edc:desc="" edc:mask="0x1" edc:name="RXOVFLIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="TXEMPTYIE" edc:desc="" edc:mask="0x1" edc:name="TXEMPTYIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXHALFIE" edc:desc="" edc:mask="0x1" edc:name="TXHALFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXNFULLIE" edc:desc="" edc:mask="0x1" edc:name="TXNFULLIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr--" edc:cname="C4FIFOUA15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuu00" edc:name="C4FIFOUA15" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F885730">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:desc="" edc:islanghidden="true" edc:mask="0x3fffffff" edc:name="FIFOUA" edc:nzwidth="0x1e"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------rrrrr" edc:cname="C4FIFOCI15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C4FIFOCI15" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0xb50" edc:_addr="0x1F885740">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CFIFOCI" edc:desc="" edc:mask="0x1f" edc:name="CFIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885750"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885760"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885770"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885780"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885790"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8857A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8857B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8857C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8857D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8857E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8857F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885800"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885810"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885820"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885830"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885840"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885850"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885860"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885870"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885880"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885890"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8858A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8858B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8858C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8858D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8858E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8858F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885900"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885910"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885920"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885930"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885940"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885950"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885960"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885970"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885980"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885990"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8859A0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8859B0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8859C0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8859D0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8859E0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F8859F0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885A00"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885A10"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885A20"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885A30"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885A40"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885A50"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885A60"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885A70"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885A80"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885A90"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885AA0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885AB0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885AC0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885AD0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885AE0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885AF0"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885B00"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885B10"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885B20"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885B30"/>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F885B40"/>
      <edc:AdjustPoint edc:offset="0x14b0" edc:_addr="0x1F885B50"/>
      <edc:SFRDef edc:access="nrnnnnnnnnnnnnnnn-nnnnn--nnnnnnn" edc:cname="ADCCON1" edc:desc="" edc:impl="0xffffbe7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000110000000000-00000--0000uuu" edc:name="ADCCON1" edc:nzwidth="32" edc:por="00000110000000000-00000--0000xxx" edc:portals="CLR SET INV" ltx:baseofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMABL" edc:mask="0x7" edc:name="DMABL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="STRGLVL" edc:mask="0x1" edc:name="STRGLVL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRQVS" edc:mask="0x7" edc:name="IRQVS" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FSPBCLKEN" edc:mask="0x1" edc:name="FSPBCLKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSSCLKEN" edc:mask="0x1" edc:name="FSSCLKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:mask="0x1" edc:name="CVDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AICPMPEN" edc:mask="0x1" edc:name="AICPMPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGSRC" edc:mask="0x1f" edc:name="STRGSRC" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FRACT" edc:mask="0x1" edc:name="FRACT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRBSLV" edc:mask="0x7" edc:name="TRBSLV" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TRBMST" edc:mask="0x7" edc:name="TRBMST" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TRBERR" edc:mask="0x1" edc:name="TRBERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRBEN" edc:mask="0x1" edc:name="TRBEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="ADC" edc:pos="14"/>
      </edc:SFRDef>
