Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMCON2" edc:desc="" edc:impl="0xffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="ADCIMCON2" edc:nzwidth="32" edc:por="--------000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN16" edc:mask="0x1" edc:name="SIGN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF16" edc:mask="0x1" edc:name="DIFF16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN17" edc:mask="0x1" edc:name="SIGN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF17" edc:mask="0x1" edc:name="DIFF17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN18" edc:mask="0x1" edc:name="SIGN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF18" edc:mask="0x1" edc:name="DIFF18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN19" edc:mask="0x1" edc:name="SIGN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF19" edc:mask="0x1" edc:name="DIFF19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN20" edc:mask="0x1" edc:name="SIGN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF20" edc:mask="0x1" edc:name="DIFF20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN21" edc:mask="0x1" edc:name="SIGN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF21" edc:mask="0x1" edc:name="DIFF21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN22" edc:mask="0x1" edc:name="SIGN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF22" edc:mask="0x1" edc:name="DIFF22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN23" edc:mask="0x1" edc:name="SIGN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF23" edc:mask="0x1" edc:name="DIFF23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN24" edc:mask="0x1" edc:name="SIGN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF24" edc:mask="0x1" edc:name="DIFF24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN25" edc:mask="0x1" edc:name="SIGN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF25" edc:mask="0x1" edc:name="DIFF25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN26" edc:mask="0x1" edc:name="SIGN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF26" edc:mask="0x1" edc:name="DIFF26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN27" edc:mask="0x1" edc:name="SIGN27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF27" edc:mask="0x1" edc:name="DIFF27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnn------nnnnnnnnnnnnnnnnnn--" edc:cname="ADCIMCON3" edc:desc="" edc:impl="0xfc0ffffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000------000000000000000000--" edc:name="ADCIMCON3" edc:nzwidth="32" edc:por="000000------000000000000000000--" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SIGN33" edc:mask="0x1" edc:name="SIGN33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF33" edc:mask="0x1" edc:name="DIFF33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN34" edc:mask="0x1" edc:name="SIGN34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF34" edc:mask="0x1" edc:name="DIFF34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN35" edc:mask="0x1" edc:name="SIGN35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF35" edc:mask="0x1" edc:name="DIFF35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN36" edc:mask="0x1" edc:name="SIGN36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF36" edc:mask="0x1" edc:name="DIFF36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN37" edc:mask="0x1" edc:name="SIGN37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF37" edc:mask="0x1" edc:name="DIFF37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN38" edc:mask="0x1" edc:name="SIGN38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF38" edc:mask="0x1" edc:name="DIFF38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN39" edc:mask="0x1" edc:name="SIGN39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF39" edc:mask="0x1" edc:name="DIFF39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN40" edc:mask="0x1" edc:name="SIGN40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF40" edc:mask="0x1" edc:name="DIFF40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN41" edc:mask="0x1" edc:name="SIGN41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF41" edc:mask="0x1" edc:name="DIFF41" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="SIGN45" edc:mask="0x1" edc:name="SIGN45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF45" edc:mask="0x1" edc:name="DIFF45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN46" edc:mask="0x1" edc:name="SIGN46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF46" edc:mask="0x1" edc:name="DIFF46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN47" edc:mask="0x1" edc:name="SIGN47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF47" edc:mask="0x1" edc:name="DIFF47" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="ADCIMCON4" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="ADCIMCON4" edc:nzwidth="32" edc:por="----------------------------0000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIGN48" edc:mask="0x1" edc:name="SIGN48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF48" edc:mask="0x1" edc:name="DIFF48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN49" edc:mask="0x1" edc:name="SIGN49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFF49" edc:mask="0x1" edc:name="DIFF49" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCGIRQEN1" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000000000000000000" edc:name="ADCGIRQEN1" edc:nzwidth="32" edc:por="----0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F887080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AGIEN0" edc:mask="0x1" edc:name="AGIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN1" edc:mask="0x1" edc:name="AGIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN2" edc:mask="0x1" edc:name="AGIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN3" edc:mask="0x1" edc:name="AGIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN4" edc:mask="0x1" edc:name="AGIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN5" edc:mask="0x1" edc:name="AGIEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN6" edc:mask="0x1" edc:name="AGIEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN7" edc:mask="0x1" edc:name="AGIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN8" edc:mask="0x1" edc:name="AGIEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN9" edc:mask="0x1" edc:name="AGIEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN10" edc:mask="0x1" edc:name="AGIEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN11" edc:mask="0x1" edc:name="AGIEN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN12" edc:mask="0x1" edc:name="AGIEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN13" edc:mask="0x1" edc:name="AGIEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN14" edc:mask="0x1" edc:name="AGIEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN15" edc:mask="0x1" edc:name="AGIEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN16" edc:mask="0x1" edc:name="AGIEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN17" edc:mask="0x1" edc:name="AGIEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN18" edc:mask="0x1" edc:name="AGIEN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN19" edc:mask="0x1" edc:name="AGIEN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN20" edc:mask="0x1" edc:name="AGIEN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN21" edc:mask="0x1" edc:name="AGIEN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN22" edc:mask="0x1" edc:name="AGIEN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN23" edc:mask="0x1" edc:name="AGIEN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN24" edc:mask="0x1" edc:name="AGIEN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN25" edc:mask="0x1" edc:name="AGIEN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN26" edc:mask="0x1" edc:name="AGIEN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AGIEN27" edc:mask="0x1" edc:name="AGIEN27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
