Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:AdjustPoint edc:offset="0x40" edc:_addr="0x1F887160"/>
      <edc:SFRDef edc:access="nnnnnnnr---nnnnnrrrrrrrrrrrrrrrr" edc:cname="ADCFLTR1" edc:desc="" edc:impl="0xff1fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000---000000000000000000000" edc:name="ADCFLTR1" edc:nzwidth="32" edc:por="00000000---000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="6" edc:_begin="0x100" edc:_end="0x110" edc:_addr="0x1F8871A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FLTRDATA" edc:mask="0xffff" edc:name="FLTRDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CHNLID" edc:mask="0x1f" edc:name="CHNLID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AFRDY" edc:mask="0x1" edc:name="AFRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFGIEN" edc:mask="0x1" edc:name="AFGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRSAM" edc:mask="0x7" edc:name="OVRSAM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DFMODE" edc:mask="0x1" edc:name="DFMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA16EN" edc:mask="0x1" edc:name="DATA16EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFEN" edc:mask="0x1" edc:name="AFEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnr---nnnnnrrrrrrrrrrrrrrrr" edc:cname="ADCFLTR2" edc:desc="" edc:impl="0xff1fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000---000000000000000000000" edc:name="ADCFLTR2" edc:nzwidth="32" edc:por="00000000---000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="7" edc:_begin="0x100" edc:_end="0x110" edc:_addr="0x1F8871B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FLTRDATA" edc:mask="0xffff" edc:name="FLTRDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CHNLID" edc:mask="0x1f" edc:name="CHNLID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AFRDY" edc:mask="0x1" edc:name="AFRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFGIEN" edc:mask="0x1" edc:name="AFGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRSAM" edc:mask="0x7" edc:name="OVRSAM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DFMODE" edc:mask="0x1" edc:name="DFMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA16EN" edc:mask="0x1" edc:name="DATA16EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFEN" edc:mask="0x1" edc:name="AFEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnr---nnnnnrrrrrrrrrrrrrrrr" edc:cname="ADCFLTR3" edc:desc="" edc:impl="0xff1fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000---000000000000000000000" edc:name="ADCFLTR3" edc:nzwidth="32" edc:por="00000000---000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="8" edc:_begin="0x100" edc:_end="0x110" edc:_addr="0x1F8871C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FLTRDATA" edc:mask="0xffff" edc:name="FLTRDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CHNLID" edc:mask="0x1f" edc:name="CHNLID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AFRDY" edc:mask="0x1" edc:name="AFRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFGIEN" edc:mask="0x1" edc:name="AFGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRSAM" edc:mask="0x7" edc:name="OVRSAM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DFMODE" edc:mask="0x1" edc:name="DFMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA16EN" edc:mask="0x1" edc:name="DATA16EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFEN" edc:mask="0x1" edc:name="AFEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnr---nnnnnrrrrrrrrrrrrrrrr" edc:cname="ADCFLTR4" edc:desc="" edc:impl="0xff1fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000---000000000000000000000" edc:name="ADCFLTR4" edc:nzwidth="32" edc:por="00000000---000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="9" edc:_begin="0x100" edc:_end="0x110" edc:_addr="0x1F8871D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FLTRDATA" edc:mask="0xffff" edc:name="FLTRDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CHNLID" edc:mask="0x1f" edc:name="CHNLID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AFRDY" edc:mask="0x1" edc:name="AFRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFGIEN" edc:mask="0x1" edc:name="AFGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRSAM" edc:mask="0x7" edc:name="OVRSAM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DFMODE" edc:mask="0x1" edc:name="DFMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA16EN" edc:mask="0x1" edc:name="DATA16EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFEN" edc:mask="0x1" edc:name="AFEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x1F8871E0"/>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="ADCTRG1" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="ADCTRG1" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="10" edc:_begin="0x110" edc:_end="0x180" edc:_addr="0x1F887200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRGSRC0" edc:mask="0x1f" edc:name="TRGSRC0" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC1" edc:mask="0x1f" edc:name="TRGSRC1" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC2" edc:mask="0x1f" edc:name="TRGSRC2" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC3" edc:mask="0x1f" edc:name="TRGSRC3" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="ADCTRG2" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="ADCTRG2" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="10" edc:_begin="0x110" edc:_end="0x180" edc:_addr="0x1F887210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRGSRC4" edc:mask="0x1f" edc:name="TRGSRC4" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC5" edc:mask="0x1f" edc:name="TRGSRC5" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC6" edc:mask="0x1f" edc:name="TRGSRC6" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC7" edc:mask="0x1f" edc:name="TRGSRC7" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
