Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="n-nnnnnnr-rrrrrrn-nnnnnn--rrrrrr" edc:cname="ADCDSTAT" edc:desc="" edc:impl="0xbfbfbf3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000000-0000000-000000--000000" edc:name="ADCDSTAT" edc:nzwidth="32" edc:por="0-0000000-0000000-000000--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="15" edc:_begin="0x1d0" edc:_end="0x220" edc:_addr="0x1F887310">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RAF0" edc:mask="0x1" edc:name="RAF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAF1" edc:mask="0x1" edc:name="RAF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAF2" edc:mask="0x1" edc:name="RAF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAF3" edc:mask="0x1" edc:name="RAF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAF4" edc:mask="0x1" edc:name="RAF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAF5" edc:mask="0x1" edc:name="RAF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RAFIEN0" edc:mask="0x1" edc:name="RAFIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAFIEN1" edc:mask="0x1" edc:name="RAFIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAFIEN2" edc:mask="0x1" edc:name="RAFIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAFIEN3" edc:mask="0x1" edc:name="RAFIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAFIEN4" edc:mask="0x1" edc:name="RAFIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAFIEN5" edc:mask="0x1" edc:name="RAFIEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DMACEN" edc:mask="0x1" edc:name="DMACEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBF0" edc:mask="0x1" edc:name="RBF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBF1" edc:mask="0x1" edc:name="RBF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBF2" edc:mask="0x1" edc:name="RBF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBF3" edc:mask="0x1" edc:name="RBF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBF4" edc:mask="0x1" edc:name="RBF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBF5" edc:mask="0x1" edc:name="RBF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="WOVERR" edc:mask="0x1" edc:name="WOVERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBFIEN0" edc:mask="0x1" edc:name="RBFIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBFIEN1" edc:mask="0x1" edc:name="RBFIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBFIEN2" edc:mask="0x1" edc:name="RBFIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBFIEN3" edc:mask="0x1" edc:name="RBFIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBFIEN4" edc:mask="0x1" edc:name="RBFIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBFIEN5" edc:mask="0x1" edc:name="RBFIEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DMAEN" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCNTB" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCNTB" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="15" edc:_begin="0x1d0" edc:_end="0x220" edc:_addr="0x1F887320">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCNTB" edc:mask="0xffffffff" edc:name="ADCCNTB" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDMAB" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDMAB" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="15" edc:_begin="0x1d0" edc:_end="0x220" edc:_addr="0x1F887330">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDMAB" edc:mask="0xffffffff" edc:name="ADCDMAB" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCTRGSNS" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000000000000000000" edc:name="ADCTRGSNS" edc:nzwidth="32" edc:por="----0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="15" edc:_begin="0x1d0" edc:_end="0x220" edc:_addr="0x1F887340">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LVL0" edc:mask="0x1" edc:name="LVL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL1" edc:mask="0x1" edc:name="LVL1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL2" edc:mask="0x1" edc:name="LVL2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL3" edc:mask="0x1" edc:name="LVL3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL4" edc:mask="0x1" edc:name="LVL4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL5" edc:mask="0x1" edc:name="LVL5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL6" edc:mask="0x1" edc:name="LVL6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL7" edc:mask="0x1" edc:name="LVL7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL8" edc:mask="0x1" edc:name="LVL8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL9" edc:mask="0x1" edc:name="LVL9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL10" edc:mask="0x1" edc:name="LVL10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL11" edc:mask="0x1" edc:name="LVL11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL12" edc:mask="0x1" edc:name="LVL12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL13" edc:mask="0x1" edc:name="LVL13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL14" edc:mask="0x1" edc:name="LVL14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL15" edc:mask="0x1" edc:name="LVL15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL16" edc:mask="0x1" edc:name="LVL16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL17" edc:mask="0x1" edc:name="LVL17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL18" edc:mask="0x1" edc:name="LVL18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL19" edc:mask="0x1" edc:name="LVL19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL20" edc:mask="0x1" edc:name="LVL20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL21" edc:mask="0x1" edc:name="LVL21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL22" edc:mask="0x1" edc:name="LVL22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL23" edc:mask="0x1" edc:name="LVL23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL24" edc:mask="0x1" edc:name="LVL24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL25" edc:mask="0x1" edc:name="LVL25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL26" edc:mask="0x1" edc:name="LVL26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL27" edc:mask="0x1" edc:name="LVL27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
