Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/edc/PIC32MK1024MCF100.PIC
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC5CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC5CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="24" edc:_begin="0x280" edc:_end="0x300" edc:_addr="0x1F887D50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="16" edc:_addr="0x1F887D60"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC7CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC7CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="24" edc:_begin="0x280" edc:_end="0x300" edc:_addr="0x1F887D70">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x80" edc:_addr="0x1F887D80"/>
      <edc:SFRDef edc:access="----rrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCSYSCFG0" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000000000000000000" edc:name="ADCSYSCFG0" edc:nzwidth="32" edc:por="----0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="25" edc:_begin="0x300" edc:_end="0x320" edc:_addr="0x1F887E00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AN0" edc:mask="0x1" edc:name="AN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN1" edc:mask="0x1" edc:name="AN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN2" edc:mask="0x1" edc:name="AN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN3" edc:mask="0x1" edc:name="AN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN4" edc:mask="0x1" edc:name="AN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN5" edc:mask="0x1" edc:name="AN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN6" edc:mask="0x1" edc:name="AN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN7" edc:mask="0x1" edc:name="AN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN8" edc:mask="0x1" edc:name="AN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN9" edc:mask="0x1" edc:name="AN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN10" edc:mask="0x1" edc:name="AN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN11" edc:mask="0x1" edc:name="AN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN12" edc:mask="0x1" edc:name="AN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN13" edc:mask="0x1" edc:name="AN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN14" edc:mask="0x1" edc:name="AN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN15" edc:mask="0x1" edc:name="AN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN16" edc:mask="0x1" edc:name="AN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN17" edc:mask="0x1" edc:name="AN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN18" edc:mask="0x1" edc:name="AN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN19" edc:mask="0x1" edc:name="AN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN20" edc:mask="0x1" edc:name="AN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN21" edc:mask="0x1" edc:name="AN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN22" edc:mask="0x1" edc:name="AN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN23" edc:mask="0x1" edc:name="AN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN24" edc:mask="0x1" edc:name="AN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN25" edc:mask="0x1" edc:name="AN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN26" edc:mask="0x1" edc:name="AN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN27" edc:mask="0x1" edc:name="AN27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------rrrrrrrrr---rrrrrrrrr-" edc:cname="ADCSYSCFG1" edc:desc="" edc:impl="0x3fe3fe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000000---000000000-" edc:name="ADCSYSCFG1" edc:nzwidth="32" edc:por="----------000000000---000000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="25" edc:_begin="0x300" edc:_end="0x320" edc:_addr="0x1F887E10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AN33" edc:mask="0x1" edc:name="AN33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN34" edc:mask="0x1" edc:name="AN34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN35" edc:mask="0x1" edc:name="AN35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN36" edc:mask="0x1" edc:name="AN36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN37" edc:mask="0x1" edc:name="AN37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN38" edc:mask="0x1" edc:name="AN38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN39" edc:mask="0x1" edc:name="AN39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN40" edc:mask="0x1" edc:name="AN40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN41" edc:mask="0x1" edc:name="AN41" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AN45" edc:mask="0x1" edc:name="AN45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN46" edc:mask="0x1" edc:name="AN46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN47" edc:mask="0x1" edc:name="AN47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN48" edc:mask="0x1" edc:name="AN48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN49" edc:mask="0x1" edc:name="AN49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN50" edc:mask="0x1" edc:name="AN50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN51" edc:mask="0x1" edc:name="AN51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN52" edc:mask="0x1" edc:name="AN52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN53" edc:mask="0x1" edc:name="AN53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1220" edc:_addr="0x1F887E20"/>
      <edc:SFRDef edc:access="------------------------nnnnnn-n" edc:cname="U1OTGIR" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------000000-0" edc:name="U1OTGIR" edc:nzwidth="0x20" edc:por="------------------------000000-0" edc:portals="CLR - -" ltx:baseofperipheral="USB1 USB" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:_begin="0x40" edc:_end="0x90" edc:_addr="0x1F889040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VBUSVDIF" edc:desc="" edc:mask="0x1" edc:name="VBUSVDIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SESENDIF" edc:desc="" edc:mask="0x1" edc:name="SESENDIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SESVDIF" edc:desc="" edc:mask="0x1" edc:name="SESVDIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTVIF" edc:desc="" edc:mask="0x1" edc:name="ACTVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSTATEIF" edc:desc="" edc:mask="0x1" edc:name="LSTATEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T1MSECIF" edc:desc="" edc:mask="0x1" edc:name="T1MSECIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDIF" edc:desc="" edc:mask="0x1" edc:name="IDIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
